#include <stdio.h>
#include <string.h>
int main(){
    //原码
  int a = 0;//0000····0000
  int b = 1;//0000····0001
  int c =-0;//1000····0000
  unsigned int d = -1;//d读取的是-1的补码1111····1111
    //以补码表示有符号数
    printf("%d\n",~a);//取反为11···11，其反码为10···00，补码为10···01，输出-1
    printf("%d\n",~b);//取反为11···10，其反码为10···01，补码为10···10，输出-2
    printf("%d\n",~c);//取反为11···11，其反码为10···00，补码为10···01，输出-1
    printf("%d\n",d);//%d输出会将错就错
    printf("%u\n",d);//%u会输出无符号整型
    printf("%u\n",~d);//取反为00···00，其反码为11···11，补码为00···00，输出0
    return 0;
}